# Amicom C 스터디 연습장

- 아미콤 C 스터디 전용 레포지토리입니다.
- 매 주차마다 학습 내용과 실습 내용을 README 파일과 각자의 C 파일에 자유롭게 작성합니다.
- 정해진 작성 형식은 없습니다.

## 1주차 배운 내용
- 표준 입력함수 printf()와 표준 출력함수 scanf()를 배웠다.
- printf()함수에서 \n을 통해 줄을 바꿀 수 있고, ""사이에 출력할 문장을 넣는다.
- scanf()함수에는 형식문자, ", 콤마(,)만이 들어갈 수 있으며 값은 형식문자의 자료형에 맞추어 넣는다.
- 자료형은 정수, 실수(부동소수점),문자로 범위가 나뉜다.
- 정수형 자료형은 int, short, long 등이 있다.(default는 int이다.)
- 실수형에는 double, float등이 있다.(default는 double이다.)
- 문자 상수에는 char을 사용한다.(문자의 나열은 배열과 포인터를 사용함.)
- usinged를 붙일 경우 양의 범위의 값만을 사용한다.(int의 경우 0~65535)
- 맨 왼쪽의 비트를 부호비트라고 하며 0일때 양수를, 1일때 음수를 표현한다.
- 음수를 표현할때 2의 보수를 사용하며 이는 1의 보수(비트 반전)에 1을 더한 값이다.

## 2주차 배운 내용
- 이곳에 작성하시면 됩니다.

## 3주차 배운 내용
- 이곳에 작성하시면 됩니다.

## 4주차 배운 내용
- 이곳에 작성하시면 됩니다.

## 5주차 배운 내용
- 이곳에 작성하시면 됩니다.

## 6주차 배운 내용
- 이곳에 작성하시면 됩니다.

## 7주차 배운 내용
- 이곳에 작성하시면 됩니다.

## 8주차 배운 내용
- 이곳에 작성하시면 됩니다.

## 9주차 배운 내용
- 이곳에 작성하시면 됩니다.

## 10주차 배운 내용
- 이곳에 작성하시면 됩니다.
